Revit 2026 API

# UIControlledApplicationFabricationPartBrowserChanged Event

---

Subscribe to MEP Fabrication part browser changed event to be notified when MEP Fabrication part browser is updated.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public event EventHandler<FabricationPartBrowserChangedEventArgs> FabricationPartBrowserChanged
```
```vb
Public Event FabricationPartBrowserChanged As EventHandler(Of FabricationPartBrowserChangedEventArgs)
```
```cpp
public:
 event EventHandler<FabricationPartBrowserChangedEventArgs^>^ FabricationPartBrowserChanged {
	void add (EventHandler<FabricationPartBrowserChangedEventArgs^>^ value);
	void remove (EventHandler<FabricationPartBrowserChangedEventArgs^>^ value);
}
```
```fsharp
member FabricationPartBrowserChanged : IEvent<EventHandler<FabricationPartBrowserChangedEventArgs>,
    FabricationPartBrowserChangedEventArgs>
```

#### Value

EventHandlerFabricationPartBrowserChangedEventArgs

#### Reference

UIControlledApplication Class

Autodesk.Revit.UI Namespace